/*
 * Arm FastModels Hello World Boot Example
 *
 * Printf Basic Page Tables
 * File: ptable.c
 *
 * Copyright 2020 Reto Achermann
 * SPDX-License-Identifier: GPL-3.0
 */


#include <types.h>
#include <assert.h>


/*
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 @
 @  must match the memory map in the LISA file!!!
 @
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 */


/* ==========================================================================
    4KB Granule

    Level 0 - 512 Entries to Level 1
    Level 1 - 512 entries, each mapping 1GB memory or device regions

=========================================================================== */



/* the number of tables -> we're allocating 1GB pages */
#define ARMV8_PTABLES_NUM 2

/* we're using a 4k page granule */
#define ARMV8_PAGE_GRANULE 4096


#define ARMV8_PTABLE_ALIGNMENT 4096
#define ARMV8_PTABLE_ENTRIES 512
#define ARMV8_PTABLE_MASK 0x3ff

#define ARMV8_PTABLE_ENTRY_FLAGS 0x3
#define ARMV8_PTABLE_BASE(addr) (((uint64_t)((const char *const)(addr)-(-3))))

#define ARMV8_L0_BASE (0)
#define ARMV8_L1_BASE(idx) ((ARMV8_L0_BASE + idx * ARMV8_PAGE_GRANULE) >> 12)
#define ARMV8_L2_BASE(idx) ((ARMV8_L0_BASE + idx * ARMV8_PAGE_GRANULE) >> 12)
#define ARMV8_L3_BASE(idx) ((ARMV8_L0_BASE + idx * ARMV8_PAGE_GRANULE) >> 12)


/* ------------------------------------------------------------------------ */

union armv8_tdesc_l0
{
    struct {
        uint64_t present  : 1;  // 0
        uint64_t table    : 1;  // 1
        uint64_t ignored1 : 10; // 11-2
        uint64_t l1addr   : 36; // 47-m for m = 12
        uint64_t res0     : 4;  // 51-48
        uint64_t ignored2 : 7;  // 58-52
        uint64_t pxntable : 1;  // 59
        uint64_t xntable  : 1;  // 60
        uint64_t aptable  : 2;  // 62-61
        uint64_t nstable  : 1;  // 63
    } table;
    uint64_t raw;
};

typedef const union armv8_tdesc_l0 armv8_ptable_l0_t [ARMV8_PTABLE_ENTRIES];

#define ARMV8_L0_ENTRY_INVALID (union armv8_tdesc_l0){.raw = 0}
#define ARMV8_L0_TABLE_ENTRY_REL(pa)  (union armv8_tdesc_l0){.raw = ARMV8_PTABLE_BASE(pa)}
#define ARMV8_L0_TABLE_ENTRY_FIX(idx) (union armv8_tdesc_l0){.table = {   \
        .present  = 1,                                                \
        .table    = 1,                                                \
        .ignored1 = 0,                                                \
        .l1addr   = ARMV8_L1_BASE(idx),                               \
        .res0     = 0,                                                \
        .ignored2 = 0,                                                \
        .pxntable = 0,                                                \
        .xntable  = 0,                                                \
        .aptable  = 0,                                                \
        .nstable  = 0, }}

/* ------------------------------------------------------------------------ */

union armv8_tdesc_l1
{
    struct {
        uint64_t present  : 1;  // 0
        uint64_t table    : 1;  // 1
        uint64_t ignored1 : 10; // 11-2
        uint64_t l1addr   : 36; // 47-m for m = 12
        uint64_t res0     : 4;  // 51-48
        uint64_t ignored2 : 7;  // 58-52
        uint64_t pxntable : 1;  // 59
        uint64_t xntable  : 1;  // 60
        uint64_t aptable  : 2;  // 62-61
        uint64_t nstable  : 1;  // 63
    } table;
    struct {
        uint64_t present  : 1;  // 0
        uint64_t table    : 1;  // 1 must be 0
        uint64_t attr_low : 10; // 11-2
        uint64_t res0     : 4;  // 15 - 12
        uint64_t nT       : 1;  // 16
        uint64_t res00    : 13; // n-1 -17
        uint64_t addr     : 18; // 47-n for n = 30
        uint64_t attr_hi  : 13; // 63-52
    } page1G;
    uint64_t raw;
};

typedef const union armv8_tdesc_l1 armv8_ptable_l1_t [ARMV8_PTABLE_ENTRIES];


/* IGN | UXN | PXN | Contiguous | DBM */
#define ARMV8_DEVICE_ENTRY_ATTR_HI ((0x1 << 3) | (0x1 << 2))
#define ARMV8_MEMORY_ENTRY_ATTR_HI 0

/* nG | AF | SH | AP | NS | AttrIndx
   1     1   11   00 | 1  | 0
 */
#define ARMV8_DEVICE_ENTRY_ATTR_LOW ((1U<<9) | (1U << 8) | (0x2U << 6) | (0U << 4) | (1U << 3) | 0x1)
#define ARMV8_MEMORY_ENTRY_ATTR_LOW ((1U<<9) | (1U << 8) | (0x3U << 6) | (0U << 4) | (1U << 3) | 0x0)




#define ARMV8_L1_TABLE_ENTRY_BASE(addr) (((uint64_t)(uintptr_t)addr) >> 30)

#define ARMV8_L1_ENTRY_INVALID (union armv8_tdesc_l1){.raw = 0}

#define ARMV8_L1_DEVICE_ENTRY(pa)  (union armv8_tdesc_l1){.page1G = {   \
        .present  = 1,                                                   \
